Repository: CofficLab/Lumi
Catalog: Plugins/LLMProviderXiaomiPlugin/Sources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: %@ API Key required
zh_hans: 需要配置 %@ 的 API Key
zh_hk: 需要設定 %@ 的 API Key

source: Configure your Xiaomi API Key below, then resend your message.
zh_hans: 请在下方配置小米 API Key，然后重新发送消息。
zh_hk: 請在下方設定小米 API Key，然後重新發送訊息。

source: Contributes Xiaomi TokenPlan and Xiaomi API (OpenAI-compatible) models to Lumi Chat.
zh_hans: 为 Lumi Chat 贡献小米 TokenPlan 与小米 API（OpenAI 兼容）模型。
zh_hk: 為 Lumi Chat 貢獻小米 TokenPlan 與小米 API（OpenAI 相容）模型。

source: Copy
zh_hans: 复制
zh_hk: 複製

source: Enter API Key
zh_hans: 输入 API Key
zh_hk: 輸入 API Key

source: Error
zh_hans: 错误
zh_hk: 錯誤

source: Get API Key on Xiaomi MIMO Platform
zh_hans: 在小米 MIMO 平台获取 API Key
zh_hk: 在小米 MIMO 平台取得 API Key

source: Hide API Key
zh_hans: 隐藏 API Key
zh_hk: 隱藏 API Key

source: Raw error details
zh_hans: 原始错误详情
zh_hk: 原始錯誤詳情

source: Received Data
zh_hans: 接收数据
zh_hk: 接收資料

source: Request / Response Details
zh_hans: 请求 / 响应详情
zh_hk: 請求 / 回應詳情

source: Request failed (HTTP %d)
zh_hans: 请求失败（HTTP %d）
zh_hk: 請求失敗（HTTP %d）

source: Sending Data
zh_hans: 发送数据
zh_hk: 傳送資料

source: Show API Key
zh_hans: 显示 API Key
zh_hk: 顯示 API Key

source: Show raw error details
zh_hans: 显示原始错误详情
zh_hk: 顯示原始錯誤詳情

source: Show request and response details
zh_hans: 显示请求和响应详情
zh_hk: 顯示請求和回應詳情

source: This model is not available on Xiaomi API
zh_hans: 此模型在小米 API 下不可用
zh_hk: 此模型在小米 API 下不可用

source: This model is not included in your Token Plan
zh_hans: 此模型不在当前 Token Plan 支持范围内
zh_hk: 此模型不在目前 Token Plan 支援範圍內

source: Xiaomi
zh_hans: 小米
zh_hk: 小米

source: Xiaomi API
zh_hans: 小米API
zh_hk: 小米API

source: Xiaomi API (OpenAI-compatible)
zh_hans: 小米API（OpenAI 兼容）
zh_hk: 小米API（OpenAI 相容）

source: Xiaomi API Key is invalid or expired
zh_hans: 小米 API Key 无效或已过期
zh_hk: 小米 API Key 無效或已過期

source: Xiaomi HTTP %lld
zh_hans: 小米 HTTP %lld
zh_hk: 小米 HTTP %lld

source: Xiaomi quota exhausted or rate limited
zh_hans: 小米额度已用尽或请求过于频繁
zh_hk: 小米額度已用盡或請求過於頻繁

source: Xiaomi request failed
zh_hans: 小米请求失败
zh_hk: 小米請求失敗

source: Xiaomi TokenPlan
zh_hans: 小米TokenPlan
zh_hk: 小米TokenPlan

source: Xiaomi TokenPlan AI Models
zh_hans: 小米 TokenPlan AI 模型
zh_hk: 小米 TokenPlan AI 模型
